CT/Term4/metopt/lectures/3.org
#+LATEX_CLASS: general
#+TITLE: Лекция 3
#+AUTHOR: Ilya Yaroshevskiy

* Одномерный поиск
** Метод золотого сечения
#+begin_remark org
Возьмем отрезок $[0, 1]$
- $x_2 = \tau \Rightarrow x_1 = 1 - \tau$
- $x_1 \Rightarrow x'_2 = 1 - \tau \in [0, \tau]$
\[ \frac{1}{\tau} = \frac{tau}{1 - \tau} \Rightarrow \tau^2 = 1 - \tau\]
\[ \tau = \frac{\sqrt{5} - 1}{2} \approx 0.61803 \]
- $x_1 = 1 - \tau = \frac{3 - \sqrt{5}}{2}$
- $x_2 = \tau = \frac{\sqrt{5} - 1}{2}$
#+end_remark
1) \label{x_1_3} $x_1 = a + \frac{3 - \sqrt{5}}{2}(b - a)$
2) \label{x_2_3} $x_2 = a + \frac{\sqrt{5} - 1}{2}(b - a)$
\[ \Delta_n = \tau^n(b - a) \]
\[ \varepsilon_n = \frac{\Delta_n}{2} = \frac{1}{2}\left(\frac{\sqrt{5} - 1}{2}\right)^n(b - a) \]
$\varepsilon$ --- задано. Окончание: $\varepsilon_n \le \varepsilon$ \\
На $n\text{-ой}$ итерации: $x^* = \frac{a_{(n)} + b_{(n)}}{2}$ \\
\[ n \ge \frac{\ln\left(\frac{2\varepsilon}{b - a}\right)}{\ln \tau} \approx 2.1 \ln\left(\frac{b - a}{2\varepsilon}\right) \]

*Алгоритм*.
1. $x_1,\ x_2$ по формулам \ref{x_1_3} и \ref{x_2_3}
   \[ \tau = \frac{\sqrt{5} - 1}{2}\ \varepsilon_n = \frac{b - a}{2} \]
2. $\varepsilon_n > \varepsilon$ --- шаг 3, иначе 4
3. Если $f(x_1) \le f(x_2)$, то:
   - запоминаем $f(x_1)$
   - $b = x_1$
   - $x_2 = x_1$
   - $x_1 = a + \tau(b - a)$
   Иначе:
   - запоминаем $f(x_2)$
   - $a = x_1$
   - $x_1 = x_2$
   - $x_2 = b - \tau(b - a)$
   $\varepsilon_n = \tau\varepsilon_n$, переход к шагу 2
4. $x^* = \bar{x} = \frac{a_{(n)} + b_{(n)}}{2}$ \\
   $f^* \approx f(\bar{x})$
** Метод Фибоначчи
\[ F_{n + 2} = F_{n + 1} + F_n\quad, n = 1,\ F_1 = F_2 = 1 \]
\[ F_n = \left(\left(\frac{1 + \sqrt{5}}{2}\right)^n - \left(\frac{1 - \sqrt{5}}{2}\right)^n\right)\cdot\frac{1}{\sqrt{5}} \]
\[ F_n \approx \left(\frac{1 + \sqrt{5}}{2}\right)^n \cdot \frac{1}{\sqrt{5}} \quad n \to \infty \]
Итерация 0:
- $x_1 = a + \frac{F_n}{F_{n + 2}} (b - a)$
- $x_2 = a + \frac{F_{n + 1}}{F_{n + 2}}(b - a) = a + b - x_1$ 
Итерация $k$:
- \[ x_1 = a_{(k)} + \frac{F_{n - k + 1}}{F_{n - k + 3}}(b_k - a_k) = a_k + \frac{F_{n -k + 1}}{F_{n + 2}}(b_0 - a_0) \]
- \[ x_2 = a_{(k)} + \frac{F_{n - k + 2}}{F_{n - k + 3}}(b_k - a_k) = a_k + \frac{F_{n -k + 2}}{F_{n + 2}}(b_0 - a_0) \]
Итерация $n$:
- $x_1 = a_n + \frac{F_1}{F_{n + 1}}(b_0 - a_0)$
- $x_2 = a_n + \frac{F_2}{F_{n + 2}}(b_0 - a_0)$
\[ \frac{b_0 - a_0}{2} = \frac{b_0 - a_0}{F_{n + 2}} < \varepsilon \]
Как выбирать $n$:
\[ \frac{b_0 - a_0}{\varepsilon} < F_{n + 2} \]
Когда $n$ большое \Rightarrow $\frac{F_n}{F_{n + 2}}$ --- бесконечная десятичная дробь
** Метод парабол
- $x_1, x_2, x_3 \in [a, b]$
- $x_1 < x_2 < x_3$
- $f(x_1) \ge f(x_2) \le f(x_3)$
\[ q(x) = a_0 + a_1(x - x_1) + a_2(x - x_1)(x - x_2) \]
- $q(x_1) = f(x_1) = f_1$
- $q(x_2) = f(x_2) = f_2$
- $q(x_3) = f(x_3) = f_3$


- $a_0 = f_1$
- $a_1 = \frac{f_2 - f_1}{x_2 - x_1}$
- $a_2 = \frac{1}{x_3 - x_2}\left(\frac{f_3 - f_1}{x_3 - x_1} - \frac{f_2 - f_1}{x_2 - x_1}\right)$
\[ \bar{x} = \frac{1}{2}\left(x_1 + x_2 - \frac{a_1}{a_2}\right)\text{ --- минимум параболы } q(x) \]
