Term4/metopt/lectures/3.tex
% Created 2021-02-27 Sat 19:38
% Intended LaTeX compiler: pdflatex
\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}

 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\theoremstyle{plain}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 3}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Одномерный поиск}
\label{sec:orgc46882b}
\subsection{Метод золотого сечения}
\label{sec:org9527fe9}
\begin{remark}
Возьмем отрезок \([0, 1]\)
\begin{itemize}
\item \(x_2 = \tau \Rightarrow x_1 = 1 - \tau\)
\item \(x_1 \Rightarrow x'_2 = 1 - \tau \in [0, \tau]\)
\end{itemize}
\[ \frac{1}{\tau} = \frac{tau}{1 - \tau} \Rightarrow \tau^2 = 1 - \tau\]
\[ \tau = \frac{\sqrt{5} - 1}{2} \approx 0.61803 \]
\begin{itemize}
\item \(x_1 = 1 - \tau = \frac{3 - \sqrt{5}}{2}\)
\item \(x_2 = \tau = \frac{\sqrt{5} - 1}{2}\)
\end{itemize}
\end{remark}
\begin{enumerate}
\item \label{x_1_3} \(x_1 = a + \frac{3 - \sqrt{5}}{2}(b - a)\)
\item \label{x_2_3} \(x_2 = a + \frac{\sqrt{5} - 1}{2}(b - a)\)
\end{enumerate}
\[ \Delta_n = \tau^n(b - a) \]
\[ \varepsilon_n = \frac{\Delta_n}{2} = \frac{1}{2}\left(\frac{\sqrt{5} - 1}{2}\right)^n(b - a) \]
\(\varepsilon\) --- задано. Окончание: \(\varepsilon_n \le \varepsilon\) \\
На \(n\text{-ой}\) итерации: \(x^* = \frac{a_{(n)} + b_{(n)}}{2}\) \\
\[ n \ge \frac{\ln\left(\frac{2\varepsilon}{b - a}\right)}{\ln \tau} \approx 2.1 \ln\left(\frac{b - a}{2\varepsilon}\right) \]

\textbf{Алгоритм}.
\begin{enumerate}
\item \(x_1,\ x_2\) по формулам \ref{x_1_3} и \ref{x_2_3}
\[ \tau = \frac{\sqrt{5} - 1}{2}\ \varepsilon_n = \frac{b - a}{2} \]
\item \(\varepsilon_n > \varepsilon\) --- шаг 3, иначе 4
\item Если \(f(x_1) \le f(x_2)\), то:
\begin{itemize}
\item запоминаем \(f(x_1)\)
\item \(b = x_1\)
\item \(x_2 = x_1\)
\item \(x_1 = a + \tau(b - a)\)
\end{itemize}
Иначе:
\begin{itemize}
\item запоминаем \(f(x_2)\)
\item \(a = x_1\)
\item \(x_1 = x_2\)
\item \(x_2 = b - \tau(b - a)\)
\end{itemize}
\(\varepsilon_n = \tau\varepsilon_n\), переход к шагу 2
\item \(x^* = \bar{x} = \frac{a_{(n)} + b_{(n)}}{2}\) \\
\(f^* \approx f(\bar{x})\)
\end{enumerate}
\subsection{Метод Фибоначчи}
\label{sec:orgf2e103d}
\[ F_{n + 2} = F_{n + 1} + F_n\quad, n = 1,\ F_1 = F_2 = 1 \]
\[ F_n = \left(\left(\frac{1 + \sqrt{5}}{2}\right)^n - \left(\frac{1 - \sqrt{5}}{2}\right)^n\right)\cdot\frac{1}{\sqrt{5}} \]
\[ F_n \approx \left(\frac{1 + \sqrt{5}}{2}\right)^n \cdot \frac{1}{\sqrt{5}} \quad n \to \infty \]
Итерация 0:
\begin{itemize}
\item \(x_1 = a + \frac{F_n}{F_{n + 2}} (b - a)\)
\item \(x_2 = a + \frac{F_{n + 1}}{F_{n + 2}}(b - a) = a + b - x_1\)
\end{itemize}
Итерация \(k\):
\begin{itemize}
\item \[ x_1 = a_{(k)} + \frac{F_{n - k + 1}}{F_{n - k + 3}}(b_k - a_k) = a_k + \frac{F_{n -k + 1}}{F_{n + 2}}(b_0 - a_0) \]
\item \[ x_2 = a_{(k)} + \frac{F_{n - k + 2}}{F_{n - k + 3}}(b_k - a_k) = a_k + \frac{F_{n -k + 2}}{F_{n + 2}}(b_0 - a_0) \]
\end{itemize}
Итерация \(n\):
\begin{itemize}
\item \(x_1 = a_n + \frac{F_1}{F_{n + 1}}(b_0 - a_0)\)
\item \(x_2 = a_n + \frac{F_2}{F_{n + 2}}(b_0 - a_0)\)
\end{itemize}
\[ \frac{b_0 - a_0}{2} = \frac{b_0 - a_0}{F_{n + 2}} < \varepsilon \]
Как выбирать \(n\):
\[ \frac{b_0 - a_0}{\varepsilon} < F_{n + 2} \]
Когда \(n\) большое \(\Rightarrow\) \(\frac{F_n}{F_{n + 2}}\) --- бесконечная десятичная дробь
\subsection{Метод парабол}
\label{sec:org103680e}
\begin{itemize}
\item \(x_1, x_2, x_3 \in [a, b]\)
\item \(x_1 < x_2 < x_3\)
\item \(f(x_1) \ge f(x_2) \le f(x_3)\)
\end{itemize}
\[ q(x) = a_0 + a_1(x - x_1) + a_2(x - x_1)(x - x_2) \]
\begin{itemize}
\item \(q(x_1) = f(x_1) = f_1\)
\item \(q(x_2) = f(x_2) = f_2\)
\item \(q(x_3) = f(x_3) = f_3\)
\end{itemize}


\begin{itemize}
\item \(a_0 = f_1\)
\item \(a_1 = \frac{f_2 - f_1}{x_2 - x_1}\)
\item \(a_2 = \frac{1}{x_3 - x_2}\left(\frac{f_3 - f_1}{x_3 - x_1} - \frac{f_2 - f_1}{x_2 - x_1}\right)\)
\end{itemize}
\[ \bar{x} = \frac{1}{2}\left(x_1 + x_2 - \frac{a_1}{a_2}\right)\text{ --- минимум параболы } q(x) \]
\end{document}
